Repository: LHHiroB/Remove-Logos-and-Objects
Catalog: App/Strings/Resources.language-*.resw
Source language: en_us
Languages: vi_vn

# Info_ResizeOptionSubTitle
source: • Fixed Width (Fixed Height): resize image to Fixed Width (Fixed Height) while keeping the aspect ratio. • Max Width (Max Height): resize image to Max Width (Max Height) if image width > Max Width (image height > Max Height) while keeping the aspect ratio. • Min Width (Min Height): resize image to Min Width (Min Height) if image height < Min Width (image height < Min Height) while keeping the aspect ratio. • Percentage: resize image in percentage. • Contain: image is scaled to maintain its aspect ratio while fitting within the image's content box. The entire object is made to fill the box, while preserving its aspect ratio. • Cover: image is resized to maintain its aspect ratio while filling the image's entire content box. If the object's aspect ratio does not match the aspect ratio of its box, then the object will be clipped to fit. • Fill: image is resized to fill the image's content box. The entire image will completely fill the box. If the image's aspect ratio does not match the aspect ratio of its box, then the image will be stretched to fit.
vi_vn: • Cố định rộng: Thay đổi kích thước hình ảnh thành chiều rộng cố định (chiều cao cố định) trong khi giữ tỷ lệ khung hình. • Độ rộng tối đa (độ cao tối đa): Thay đổi kích thước hình ảnh thành chiều rộng tối đa (chiều cao tối đa) nếu chiều rộng hình ảnh > chiều rộng tối đa (chiều cao hình ảnh > chiều cao tối đa) trong khi giữ tỷ lệ khung hình. • Độ rộng tối thiểu (độ cao tối thiểu): Thay đổi kích thước hình ảnh thành chiều rộng tối thiểu (chiều cao tối thiểu) Nếu chiều cao hình ảnh < chiều rộng tối thiểu (chiều cao hình ảnh < chiều cao tối thiểu) trong khi giữ tỷ lệ khung hình. • Tỷ lệ phần trăm: Thay đổi kích thước hình ảnh theo tỷ lệ phần trăm. • Chứa trong: hình ảnh được chia tỷ lệ để duy trì tỷ lệ khung hình của nó trong khi lắp trong hộp nội dung của hình ảnh. Toàn bộ đối tượng được tạo để lấp đầy hộp, trong khi bảo tồn tỷ lệ khung hình của nó. • Phủ toàn bộ: Hình ảnh được thay đổi kích thước để duy trì tỷ lệ khung hình của nó trong khi lắp vào toàn bộ hộp nội dung của hình ảnh. Nếu tỷ lệ khung hình của đối tượng không khớp với tỷ lệ khung hình của hộp của nó, thì đối tượng sẽ được cắt để phù hợp. • Lấp đầy: Hình ảnh được thay đổi kích thước để lắp vào hộp nội dung của hình ảnh. Toàn bộ hình ảnh sẽ hoàn toàn lắp vào khung chứa. Nếu tỷ lệ khung hình của hình ảnh không khớp với tỷ lệ khung hình chứa thì ảnh sẽ được kéo giãn để Lấp đầy.

# Info_ImageFitTypeTitle
source: Image fit type
vi_vn: Cách điều chỉnh kích thước

# Info_ImageFitTypeSubTitle
source: Allow to embed multiple sizes in an ICO file and set how image should be resized to fit image container: • Contain: image is scaled to maintain its aspect ratio while fitting within the image's content box. The entire object is made to fill the box, while preserving its aspect ratio. • Cover: image is resized to maintain its aspect ratio while filling the image's entire content box. If the object's aspect ratio does not match the aspect ratio of its box, then the object will be clipped to fit. • Fill: image is resized to fill the image's content box. The entire image will completely fill the box. If the image's aspect ratio does not match the aspect ratio of its box, then the image will be stretched to fit.
vi_vn: Cho phép nhúng nhiều kích thước vào tệp ICO và đặt cách thức hình ảnh phải được thay đổi kích thước để phù hợp với vùng chứa hình ảnh: • Chứa trong: hình ảnh được chia tỷ lệ để duy trì tỷ lệ khung hình của nó trong khi lắp trong hộp nội dung của hình ảnh. Toàn bộ đối tượng được tạo để lấp đầy hộp, trong khi bảo tồn tỷ lệ khung hình của nó. • Phủ toàn bộ: Hình ảnh được thay đổi kích thước để duy trì tỷ lệ khung hình của nó trong khi lắp vào toàn bộ hộp nội dung của hình ảnh. Nếu tỷ lệ khung hình của đối tượng không khớp với tỷ lệ khung hình của hộp của nó, thì đối tượng sẽ được cắt để phù hợp. • Lấp đầy: Hình ảnh được thay đổi kích thước để lắp vào hộp nội dung của hình ảnh. Toàn bộ hình ảnh sẽ hoàn toàn lắp vào khung chứa. Nếu tỷ lệ khung hình của hình ảnh không khớp với tỷ lệ khung hình chứa thì ảnh sẽ được kéo giãn để lấp đầy.

# Info_TransparentTitle
source: Image transparent
vi_vn: Hình ảnh trong suốt

# Info_TransparentSubTitle
source: Keep or fill transparent area with color.
vi_vn: Giữ hoặc tô màu phần trong suốt.

# Info_LevelTitle
source: Optimization level
vi_vn: Mức tối ưu hóa

# Info_LevelSubTitle
source: The higher value provides the smaller files but more time-consuming without affect to image quality, ranges from 0 to 100.
vi_vn: Giá trị cao hơn cung cấp các tệp nhỏ hơn nhưng tốn nhiều thời gian hơn mà không ảnh hưởng đến chất lượng hình ảnh, dao động từ 0 đến 100.

# Info_QualityTitle
source: Compression quality
vi_vn: Chất lượng nén

# Info_QualitySubTitle
source: The compression factor for RGB channels. Small value produces smaller file with lower quality, higher value outputs bigger file but with better quality.
vi_vn: Hệ số nén cho các kênh RGB. Giá trị nhỏ tạo ra tệp nhỏ hơn với chất lượng thấp hơn, giá trị cao hơn tệp lớn hơn nhưng với chất lượng tốt hơn.

# Info_BackgroundColorTitle
source: Background color
vi_vn: Màu nền

# Info_BackgroundColorSubTitle
source: Fill transparent area with color.
vi_vn: Tô màu vào phần trong suốt.

# Info_ProgressiveTitle
source: Progressive
vi_vn: Lũy tiến (progressive)

# Info_ProgressiveSubTitle
source: Choose the way it compresses and displays image: • Baseline: from top to bottom. • Progressive: from blurry to sharp. This is ideal for large images that will be displayed while downloading over a slow connection, allowing a reasonable preview after receiving only a portion of the data.
vi_vn: Chọn cách nó nén và hiển thị hình ảnh: • Đường cơ sở (baseline): Từ trên xuống dưới. • Lũy tiến (progressive): Từ mờ đến sắc nét. phù hợp cho các hình ảnh lớn sẽ được hiển thị trong khi tải xuống kết nối chậm, cho phép xem trước ảnh dưới dạng mờ khi chỉ nhận được một phần dữ liệu.

# Info_InterlacedTitle
source: Interlaced
vi_vn: Xen kẽ (interlaced)

# Info_InterlacedSubTitle
source: Choose the way it compresses and displays image: • Non-interlaced: image will load and display line by line from top to bottom. • Interlaced: image is loaded from odd lines and displayed on odd lines, then continue to load and display on even lines.
vi_vn: Chọn cách nó nén và hiển thị hình ảnh: • Không xen kẽ (non-interlaced): Hình ảnh sẽ tải và hiển thị theo dòng từ trên xuống dưới. • Xen kẽ (interlaced): tải các đường lẻ của ảnh và hiển thị các đường lẻ, sau đó tiếp tục tải và hiển thị đường chẵn.

# Info_InterlacedProgressiveTitle
source: Interlaced PNG and Progressive JPEG
vi_vn: Xen kẽ PNG và lũy tiến JPEG (interlaced và progressive)

# Info_InterlacedProgressiveSubTitle
source: INTERLACED (PNG) • Non-interlaced PNG: image will load and display line by line from top to bottom. • Interlaced PNG: image is loaded from odd lines and displayed on odd lines, then continue to load and display on even lines. PROGRESSIVE (JPEG) • Baseline JPEG: from top to bottom. • Progressive JPEG: from blurry to sharp. This is ideal for large images that will be displayed while downloading over a slow connection, allowing a reasonable preview after receiving only a portion of the data.
vi_vn: Xen kẽ PNG (interlaced) • Không xen kẽ (non-interlaced): Hình ảnh sẽ tải và hiển thị theo dòng từ trên xuống dưới. • Xen kẽ (interlaced): tải các đường lẻ của ảnh và hiển thị các đường lẻ, sau đó tiếp tục tải và hiển thị đường chẵn. Lỹ tiến JPEG (progressive) • Đường cơ sở (baseline): Từ trên xuống dưới. • Lũy tiến (progressive): Từ mờ đến sắc nét. phù hợp cho các hình ảnh lớn sẽ được hiển thị trong khi tải xuống kết nối chậm, cho phép xem trước ảnh dưới dạng mờ khi chỉ nhận được một phần dữ liệu.

# Info_DiscardIfLargerSizeTitle
source: Discard output image if its size is larger than original one?
vi_vn: Loại bỏ hình ảnh đầu ra nếu kích thước của nó lớn hơn ảnh gốc?

# Info_DiscardIfLargerSizeSubTitle
source: If the original file is already compressed, when compressing again, the size of the compressed file may be larger than the size of the original file, it will be replaced with the original file.
vi_vn: Nếu tệp gốc đã được nén, khi nén lại, kích thước của tệp nén có thể lớn hơn kích thước của tệp gốc, nó sẽ được thay thế bằng tệp gốc.

# Info_OptimizeOutputFileSizeTitle
source: File optimization
vi_vn: Tối ưu hóa tệp

# Info_OptimizeOutputFileSizeSubTitle
source: Try compressing the output file so that it has a smaller file size.
vi_vn: Thử nén tệp đầu ra để nó có kích thước tệp nhỏ hơn.

# Info_NumberOfColorsTitle
source: Image colors
vi_vn: Số lượng màu sắc

# Info_NumberOfColorsSubTitle
source: Change the color pallette of the output image. The higher the value, the wider variety of colors that the output image can display.
vi_vn: Thay đổi pallette màu của hình ảnh đầu ra. Giá trị càng cao, nhiều màu sắc mà hình ảnh đầu ra có thể hiển thị càng rộng.

# Info_DitherMethodSubTitle
source: Dithering refers to the method of simulating colors not available in color palette. Images with continuous-tone color (especially color gradients) may require dithering to prevent color banding.
vi_vn: Phương pháp mô phỏng màu sắc không có sẵn trong bảng màu. Hình ảnh có màu tông màu liên tục (đặc biệt là độ dốc màu rộng) có thể yêu cầu hòa sắc để làm giảm cảm giác màu bị gãy.

# Info_WebpLosslessSubTitle
source: Whether the output image should be lossless or lossy.
vi_vn: Lựa chọn nén mất hoặc nén không mất dữ liệu cho ảnh đầu ra.

# Info_WebpMethodTitle
source: Method
vi_vn: Phương pháp nén

# Info_WebpMethodSubTitle
source: The compression method to use, it controls the trade off between encoding speed and the compressed file size and quality. When higher values are utilized, the encoder spends more time inspecting additional encoding possibilities and decide on the quality gain.
vi_vn: Kiểm soát sự đánh đổi giữa tốc độ mã hóa và kích thước và chất lượng tệp nén. Khi các giá trị cao hơn được sử dụng, bộ mã hóa dành nhiều thời gian hơn để kiểm tra các nhiều phương pháp nén hơn để chọn ra phương pháp tốt nhất về chất lượng nén.

# Info_WebpNearLosslessTitle
source: Near lossless quality
vi_vn: Chất lượng Near lossless

# Info_WebpNearLosslessSubTitle
source: The near lossless encoding, between 0 (max-loss) and 100 (off).
vi_vn: Mã hóa gần như không mất, giữa 0 (mất tối đa) và 100 (tắt).

# Info_WebpImageHintTitle
source: Image characteristics
vi_vn: Đặc điểm hình ảnh

# Info_WebpImageHintSubTitle
source: The characteristics of image: • Default: default preset. • Picture: digital picture from camera, like portrait, object shooting. • Photo: picture taken from outdoor shooting with natural lighting. • Graph: picture with discrete tone like graph, map-tile, …
vi_vn: Các đặc điểm của hình ảnh: • Mặc định: Đặt trước mặc định. • Hình ảnh: Hình ảnh kỹ thuật số từ máy ảnh, như chân dung, chụp đối tượng. • Ảnh: Hình ảnh chụp từ chụp ngoài trời với ánh sáng tự nhiên. • Đồ thị: hình ảnh có âm sắc như đồ thị, gạch bản đồ,

# Info_BrightnessWhiteBalanceSingleTitle
source: Brightness and White Balance
vi_vn: Độ sáng và cân bằng trắng

# Info_BrightnessWhiteBalanceSingleSubTitle
source: These settings apply for Camera Raw Image Format only. Disable auto brightness: disable automatic increase in brightness by histogram. White balance: balance the color temperature in your image, select setting bellow to generate image with color as need: • Use Camera: use RAW-embedded color profile from the photo. • Auto: use suitable white balance mode after averaging over the entire image. • None: do not use 2 options above. * These settings must reload image and consume time to apply to preview by check "Auto" or click direct to "Reload" button.
vi_vn: Các cài đặt này chỉ áp dụng cho định dạng hình ảnh raw chụp bằng Camera. Tắt độ sáng tự động: Tắt tăng độ sáng tự động bằng biểu đồ. Cân bằng trắng: Cân bằng nhiệt độ màu trong hình ảnh của bạn, chọn Cài đặt dưới đây để tạo hình ảnh có màu khi cần: • Sử dụng camera: Sử dụng cấu hình màu được lưu trong ảnh. • Tự động: Sử dụng Chế độ cân bằng trắng phù hợp sau khi lấy trung bình trên toàn bộ hình ảnh. • Không: Không sử dụng 2 tùy chọn ở trên. * Các cài đặt này phải tải lại hình ảnh và tiêu tốn thời gian, để tải lại tự động, đánh vào dấu kiểm "Tự động" hoặc nhấp trực tiếp nút "Tải lại".

# Info_BrightnessWhiteBalanceMultipleTitle
source: Brightness and White Balance
vi_vn: Độ sáng và cân bằng trắng

# Info_BrightnessWhiteBalanceMultipleSubTitle
source: These settings apply for Camera Raw Image Format only. Disable auto brightness: disable automatic increase in brightness by histogram. White balance: balance the color temperature in your image, select setting bellow to generate image with color as need: • Use Camera: use RAW-embedded color profile from the photo. • Auto: use suitable white balance mode after averaging over the entire image. • None: do not use 2 options above.
vi_vn: Các cài đặt này chỉ áp dụng cho định dạng hình ảnh raw chụp bằng Camera. Tắt độ sáng tự động: Tắt tăng độ sáng tự động bằng biểu đồ. Cân bằng trắng: Cân bằng nhiệt độ màu trong hình ảnh của bạn, chọn Cài đặt dưới đây để tạo hình ảnh có màu khi cần: • Sử dụng camera: Sử dụng cấu hình màu được lưu trong ảnh. • Tự động: Sử dụng Chế độ cân bằng trắng phù hợp sau khi lấy trung bình trên toàn bộ hình ảnh. • Không: Không sử dụng 2 tùy chọn ở trên.
